






* English?

Test

Ελληνικά;

| ! | name    | hours | hourlyrate |  sum |
|---+---------+-------+------------+------|
| # | Sacha   |    12 |         55 |  660 |
| # | Kosta   |    30 |         75 | 2250 |
| # |         |       |            |      |
| # |         |       |            |      |
| # |         |       |            |      |
| # | Carsten |     5 |        100 |  500 |
|---+---------+-------+------------+------|
| # |         |       |            | 3410 |
| ^ |         |       |            |      |
#+TBLFM: $5=$hours * $hourlyrate::@8$5=vsum(@I..@-I)



|   |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  2 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  4 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 16 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                256 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              65536 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         4294967296 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               18446744073709551616 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            340282366920938463463374607431768211456 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     115792089237316195423570985008687907853269984665640564039457584007913129639936 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        13407807929942597099574024998205846127479365820592393377723561443721764030073546976801874298166903427690031858186486050853753882811946569946433649006084096 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              179769313486231590772930519078902473361797697894230657273430081157732675805500963132708477322407536021120113879871393357658789768814416622492847430639474124377767893424865485276302219601246094119453082952085005768838150682342462881473913110540827237163350510684586298239947245938479716304835356329624224137216 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          32317006071311007300714876688669951960444102669715484032130345427524655138867890893197201411522913463688717960921898019494119559150490921095088152386448283120630877367300996091750197750389652106796057638384067568276792218642619756161838094338476170470581645852036305042887575891541065808607552399123930385521914333389668342420684974786564569494856176035326322058077805659331026192708460314150258592864177116725943603718461857357598351152301645904403697613233287231227125684710820209725157101726931323469678542580656697935045997268352998638215525166389437335543602135433229604645318478604952148193555853611059596230656 |
| # | 1044388881413152506691752710716624382579964249047383780384233483283953907971557456848826811934997558340890106714439262837987573438185793607263236087851365277945956976543709998340361590134383718314428070011855946226376318839397712745672334684344586617496807908705803704071284048740118609114467977783598029006686938976881787785946905630190260940599579453432823469303026696443059025015972399867714215541693835559885291486318237914434496734087811872639496475100189041349008417061675093668333850551032972088269550769983616369411933015213796825837188091833656751221318492846368125550225998300412344784862595674492194617023806505913245610825731835380087608622102834270197698202313169017678006675195485079921636419370285375124784014907159135459982790513399611551794271106831134090584272884279791554849782954323534517065223269061394905987693002122963395687782878948440616007412945674919823050571642377154816321380631045902916136926708342856440730447899971901781465763473223850267253059899795996090799469201774624817718449867455659250178329070473119433165550807568221846571746373296884912819520317457002440926616910874148385078411929804522981857338977648103126085903001302413467189726673216491511131602920781738033436090243804708340403154190336 |
#+TBLFM: $2=@-1 ^ 2


| # |                                                                                                                                                           3 |
| # |                                                                                                                                                           5 |
| # |                                                                                                                                                          17 |
| # |                                                                                                                                                         257 |
| # |                                                                                                                                                       65537 |
| # |                                                                                                                                                  4294967297 |
| # |                                                                                                                                        18446744073709551617 |
| # |                                                                                                                     340282366920938463463374607431768211457 |
| # |                                                                              115792089237316195423570985008687907853269984665640564039457584007913129639937 |
| # | 13407807929942597099574024998205846127479365820592393377723561443721764030073546976801874298166903427690031858186486050853753882811946569946433649006084097 |
#+TBLFM: $2=((@-1 - 1) ^ 2) + 1

|   |                                                                                                                                                                                                                                                                                                                                                            3 |
| # |                                                                                                                                                                                                                                                                                                                                                           27 |
| # |                                                                                                                                                                                                                                                                                                                                                        19683 |
| # |                                                                                                                                                                                                                                                                                                                                                7625597484987 |
| # |                                                                                                                                                                                                                                                                                                                      443426488243037769948249630619149892803 |
| # |                                                                                                                                                                                                                                         87189642485960958202911070585860771696964072404731750085525219437990967093723439943475549906831683116791055225665627 |
| # | 662818605424187176105172864214479748588986673875686419462793267420461248113287928124072014075084032555900857691049061274135779819474602180821485109388447092848836753879024702508785576075431392037236950553064188689954912598712398079759040464474717726449363185622056684690721420542800623411346656785162817900551337542270334990205437212700131838846883 |
#+TBLFM: $2=@-1 ^ 3

| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         3 |
| # |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        27 |
| # | 373391848741020043532959754184866588225409776783734007750636931722079040617265251229993688938803977220468765065431475158108727054592160858581351336982809187314191748594262580938807019951956404285571818041046681288797402925517668012340617298396574731619152386723046235125934896058590588284654793540505936202376547807442730582144527058988756251452817793413352141920744623027518729185432862375737063985485319476416926263819972887006907013899256524297198527698749274196276811060702333710356481 |
#+TBLFM: @2$2=3 ^ 3;::@3$2=3^4^5;
